tap "databricks/tap"
tap "docker/tap"
tap "smithy-lang/tap"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "biome"
brew "cfn-lint"
brew "cmake"
brew "coreutils"
brew "databricks/tap/databricks"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "glow"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "gradle"
brew "gum"
brew "iredis"
brew "jq"
brew "lefthook"
brew "libpq"
brew "mas"
brew "openjdk"
brew "pkgconf"
brew "rbenv"
brew "smithy-lang/tap/smithy-cli"
brew "tree"
brew "typescript-language-server"
brew "uv"
brew "vim"
brew "volta"
brew "watch"
brew "yq"
cask "azookey"
cask "chatgpt"
cask "claude"
cask "codex"
cask "codex-app"
cask "dbeaver-community"
cask "docker-desktop"
cask "drawio"
cask "finch"
cask "firefox"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "git-credential-manager"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kiro"
cask "kiro-cli"
cask "logi-options+"
cask "sbx"
cask "session-manager-plugin"
cask "slack"
cask "visual-studio-code"
mas "Microsoft To Do", id: 1274495053
