tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "cfn-lint"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "glow"
brew "go"
brew "golangci-lint"
brew "iredis"
brew "jq"
brew "lefthook"
brew "libpq"
brew "mas"
brew "openjdk"
brew "peco"
brew "pyenv"
brew "rbenv"
brew "session-manager-plugin"
brew "tree"
brew "vim"
brew "volta"
brew "watch"
brew "yq"
cask "dbeaver-community"
cask "cmake"
cask "docker"
cask "drawio"
cask "finch"
cask "firefox"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "postman"
cask "session-manager-plugin"
cask "visual-studio-code"
mas "Microsoft To Do", id: 1274495053
mas "Slack", id: 803453959
vscode "ahebrank.yaml2json"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amodio.restore-editors"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grafana.vscode-jsonnet"
vscode "gruntfuggly.todo-tree"
vscode "hogashi.crontab-syntax-highlight"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "kddejong.vscode-cfn-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
