tap "databricks/tap"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "biome"
brew "cfn-lint"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "glow"
brew "go"
brew "golangci-lint"
brew "iredis"
brew "jq"
brew "lefthook"
brew "libpq"
brew "mas"
brew "openjdk"
brew "pkgconf"
brew "rbenv"
brew "tree"
brew "uv"
brew "vim"
brew "volta"
brew "watch"
brew "yq"
brew "databricks/tap/databricks"
cask "amazon-q"
cask "azookey"
cask "chatgpt"
cask "claude"
cask "dbeaver-community"
cask "docker-desktop"
cask "drawio"
cask "finch"
cask "firefox"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "git-credential-manager"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kiro"
cask "logi-options+"
cask "session-manager-plugin"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
vscode "ahebrank.yaml2json"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "amodio.restore-editors"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "gruntfuggly.todo-tree"
vscode "hangxingliu.vscode-systemd-support"
vscode "hogashi.crontab-syntax-highlight"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "kddejong.vscode-cfn-lint"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
